# Manipulación de datos con pandas

In [34]:
import pandas as pd
import numpy as np

## Series

In [35]:
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [36]:
data.values #Accedemos a los valores

array([0.25, 0.5 , 0.75, 1.  ])

In [37]:
data.index #Accedemos al índice

RangeIndex(start=0, stop=4, step=1)

In [38]:
#Segmentos de la información
data[1]
data[1:3]

1    0.50
2    0.75
dtype: float64

In [39]:
data = pd.Series([0.25,0.5,0.75,1.0],index = ['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [40]:
data['b']

0.5

In [41]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],index=[2, 5, 3, 7])
data[5] #Note a qué posición accedo

0.5

In [42]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [43]:
population['California']

38332521

In [44]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [45]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

## DataFrame

In [46]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [47]:
states = pd.DataFrame({'population': population,'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [48]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [49]:
states.columns

Index(['population', 'area'], dtype='object')

In [50]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

### Construcción

In [51]:
#Una sola serie
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [52]:
#Lista de diccionarios
data = [{'a': i, 'b': 2 * i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [53]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [54]:
#Diccionario de series
pd.DataFrame({'population': population,'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [55]:
# Matriz de dos dimensiones
pd.DataFrame(np.random.rand(3, 2),columns=['foo', 'bar'],index=['a', 'b', 'c'])

        foo       bar
a  0.476272  0.556984
b  0.350834  0.333933
c  0.071379  0.508928

## Index

In [56]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [57]:
#Son inmutables
ind[1]
ind[::2]
print(ind.size, ind.shape, ind.ndim, ind.dtype)
#ind[1] = 0

5 (5,) 1 int64

In [58]:
#Conjunto ordenado
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

indA & indB # intersection
indA | indB # union
indA ^ indB # symmetric difference

C:\Users\josea\AppData\Local\Temp\ipykernel_1724\2166693450.py:5: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  indA & indB # intersection
C:\Users\josea\AppData\Local\Temp\ipykernel_1724\2166693450.py:6: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  indA | indB # union
C:\Users\josea\AppData\Local\Temp\ipykernel_1724\2166693450.py:7: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead.
  indA ^ indB # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

## Selección

In [59]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [60]:
#'a' in data
#data.keys()
#list(data.items())

In [61]:
data['e'] = 1.25

In [62]:
# slicing by explicit index
data['a':'c']
# slicing by implicit integer index
data[0:2]
# masking
data[(data > 0.3) & (data < 0.8)]
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

### Indexadores: loc, iloc e ix

In [63]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

# explicit index when indexing
data[1]
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [64]:
#Loc: explícito
data.loc[1]
data.loc[1:3]

1    a
3    b
dtype: object

In [65]:
#iloc: implícito
data.iloc[1]
data.iloc[1:3]

3    b
5    c
dtype: object

> Explícito es mejor que implícito

- Código limpio y legible.
- Dependerá de cómo vienen los datos.

#### DataFrame

In [66]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                 'New York': 141297, 'Florida': 170312,
                 'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [67]:
data['area']
data.area
data.area is data['area']

True

In [68]:
#¡Cuidado con los built-in y métodos!
data.pop is data['pop']

False

In [69]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [70]:
data.values
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [71]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [72]:
data.iloc[:3, :2]
data.loc[:'Illinois', :'pop']
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [73]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [74]:
data['Florida':'Illinois']
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

## Funciones

In [75]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [76]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [77]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [78]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [79]:
area.index | population.index

C:\Users\josea\AppData\Local\Temp\ipykernel_1724\3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [80]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [81]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [82]:
import numpy.random as rng
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),columns=list('AB'))
A

    A   B
0   8  14
1  16  13

In [83]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),columns=list('BAC'))
B

   B  A  C
0  0  7  6
1  9  8  5
2  6  5  4

In [84]:
A + B

      A     B   C
0  15.0  14.0 NaN
1  24.0  22.0 NaN
2   NaN   NaN NaN

In [85]:
fill = A.stack().mean() #Media de todos los valores del DF A
A.add(B, fill_value=fill)

       A      B      C
0  15.00  14.00  18.75
1  24.00  22.00  17.75
2  17.75  18.75  16.75

|Operador|Método|
|--------|------|
|+|add|
|-|sub, substract|
|*|mul, multiply|
|/|truediv, div, divide|
|//|floordiv|
|%|mod|
|**|pow|

In [86]:
A = rng.randint(10, size=(3, 4))
A - A[0]

array([[ 0,  0,  0,  0],
       [-6, -6,  0,  1],
       [-2,  2, -1,  4]])

In [87]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -6 -6  0  1
2 -2  2 -1  4

In [88]:
#Usando métodos, podemos hacer operaciones sobre las columnas
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  0  0 -6 -6
1  0  0  0  1
2 -4  0 -9 -4

In [89]:
halfrow = df.iloc[0, ::2]
halfrow

Q    7
S    1
Name: 0, dtype: int32

In [90]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -6.0 NaN  0.0 NaN
2 -2.0 NaN -1.0 NaN

Las operaciones en Pandas siempre mantiene el contexto de los datos. Previene errores cuando se trabaja con arrays heterogéneos o desalineados.

## Manejando información faltante

In [91]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

El tipo object es el tipo más común. Indica que los contenidos del array son objetos de Python. Sin embargo, no especificar uno en concreto puede ralentizar funciones que están optimizadas para dicho tipo.

In [92]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
104 ms ± 7.55 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
4.66 ms ± 644 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [93]:
#None
#vals1 + 0
#NaN
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype
vals2 + 0

array([ 1., nan,  3.,  4.])

In [94]:
x = pd.Series(range(2), dtype=int)
x[0] = None
x #Note el cambio de tipo

0    NaN
1    1.0
dtype: float64

In [95]:
# Detección
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [96]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [97]:
data.dropna()

0        1
2    hello
dtype: object

In [98]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [99]:
df.dropna()
df.dropna(axis='columns')
df[3] = np.nan
df.dropna(axis='columns', how='all')
df.dropna(axis='rows', thresh=3) #Mínimo de valores no nulos

     0    1  2   3
1  2.0  3.0  5 NaN

In [100]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [101]:
data.fillna(0)
# forward-fill
data.fillna(method='ffill')
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [102]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

## Combinar bases

### Concatenar

In [138]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
    for c in cols}
    return pd.DataFrame(data, ind)
# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [140]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])
#ser1.append(ser2) #Antiguo

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [141]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [74]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
print(df3); print(df4); print(pd.concat([df3, df4], axis=1)); print(pd.concat([df3, df4], axis=0))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1

In [146]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index # make duplicate indices!
print(x); print(y); print(pd.concat([x, y]))
concatenado = pd.concat([x, y])
concatenado.loc[0,:]

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

    A   B
0  A0  B0
0  A2  B2

In [149]:
#pd.concat([x, y], verify_integrity=True) #Segura, dará error si no tiene la estructura correcta
#pd.concat([x, y], ignore_index = True)
print(pd.concat([x, y], keys=['x', 'y'])) #Multiindex

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [155]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
#print(df5); print(df6); print(pd.concat([df5, df6]))
#print(pd.concat([df5, df6], join='inner')) #Solo las columnas que comparten
####pd.concat([df5, df6], join_axes=[df5.columns]) ##REVISARLO

### Merge and Join

In [156]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [161]:
df3 = pd.merge(df1, df2) #Función de pandas
#df3
df1.merge(df2) #Método de la clase DataFrame (devuelven un resultado)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [162]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [163]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                              'skills': ['math', 'spreadsheets', 'coding', 'linux',
                                         'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [164]:
#Misma info pero las columnas se llaman diferente
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3); #rename(columns = {'name':'employee'})
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [ ]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1).renae.reset.metodos... #Eliminamos columnas
df.assign(TC = 500).loc[df[V1]>0].groupby([]).sum()
%>% mutate %>% filter %>% groupby %>% summarise

In [168]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [169]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [171]:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name')) #on: columna #index = index

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [174]:

df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
'drink': ['wine', 'beer']},
columns=['name', 'drink'])
print('Base 6 \n',df6); print('Base 7 \n', df7);

Base 6
     name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
Base 7
      name drink
0    Mary  wine
1  Joseph  beer

Tipos:
- inner
- outer
- left
- right

In [179]:
#print(pd.merge(df6, df7, how='left')) #Comida y bebida de los que pidieron comida
print(pd.merge(df6, df7, how='outer')) #Todos los comensales
#print(pd.merge(df6, df7, how='right'))#Comida y bebida de los que pidieron bebida
print(pd.merge(df6, df7, how='inner')) #Los que pidieron comida y bebida

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer
   name   food drink
0  Mary  bread  wine

In [185]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
print(df8); print(df9);
#print(pd.merge(df8, df9))
#print(pd.merge(df8, df9, on="name"))
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

## Agrupaciones

In [186]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

Información de planetas que los astrónomos han descubierno alrededor de otras estrellas (exoplanetas).

In [187]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [188]:
import numpy as np
import pandas as pd
#Agregaciones simples
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
print(ser.sum())
print(ser.mean()) #Media
print(ser.std()) #Desviación estándar

2.811925491708157
0.5623850983416314
0.30874824961862174

In [195]:
#print(planets.mean(numeric_only=True)) #Solo las variables con número
print(planets.mean(axis = 'columns',numeric_only=True)) #Se hace la media con cada fila

0       472.160000
1       588.586800
2       559.488000
3       492.810000
4       531.238000
           ...
1030    545.735377
1031    539.653966
1032    546.297881
1033    576.531271
1034    568.296939
Length: 1035, dtype: float64

In [197]:
#Ciclo inicial análisis de datos
planets.shape #La cantidad de elementos
print(planets.dtypes) #Tipos de las variables
planets.describe() #summary
planets.dropna().describe()

method             object
number              int64
orbital_period    float64
mass              float64
distance          float64
year                int64
dtype: object

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

### Groupby

<img src="groupby.png" width = 900 height = 500>

In [204]:
planets.groupby('method') #¿Qué tipo de objeto estamos obteniendo?
planets.groupby('method').max() #nanmax

                               number  orbital_period   mass  distance  year
method
Astrometry                          1     1016.000000    NaN     20.77  2013
Eclipse Timing Variations           2    10220.000000   6.05    500.00  2012
Imaging                             4   730000.000000    NaN    165.00  2013
Microlensing                        2     5100.000000    NaN   7720.00  2013
Orbital Brightness Modulation       2        1.544929    NaN   1180.00  2013
Pulsar Timing                       3    36525.000000    NaN   1200.00  2011
Pulsation Timing Variations         1     1170.000000    NaN       NaN  2007
Radial Velocity                     6    17337.500000  25.00    354.00  2014
Transit                             7      331.600590   1.47   8500.00  2014
Transit Timing Variations           3      160.000000    NaN   2119.00  2014

In [205]:
planets.groupby('method')['orbital_period'] #Selección variables
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [208]:
#Iteración
#Aprovecharme de esta estructura y aplicarles distintas funciones
for (method, group) in planets.groupby('method'): #Iterador (variable discriminante / index , valores del grupo)
    print(method)
    print(group)
    #print("{0:30s} shape={1}".format(method, group.shape))

Astrometry
         method  number  orbital_period  mass  distance  year
113  Astrometry       1          246.36   NaN     20.77  2013
537  Astrometry       1         1016.00   NaN     14.98  2010
Eclipse Timing Variations
                       method  number  orbital_period  mass  distance  year
32  Eclipse Timing Variations       1        10220.00  6.05       NaN  2009
37  Eclipse Timing Variations       2         5767.00   NaN    130.72  2008
38  Eclipse Timing Variations       2         3321.00   NaN    130.72  2008
39  Eclipse Timing Variations       2         5573.55   NaN    500.00  2010
40  Eclipse Timing Variations       2         2883.50   NaN    500.00  2010
41  Eclipse Timing Variations       1         2900.00   NaN       NaN  2011
42  Eclipse Timing Variations       1         4343.50  4.20       NaN  2012
43  Eclipse Timing Variations       2         5840.00   NaN       NaN  2011
44  Eclipse Timing Variations       2         1916.25   NaN       NaN  2011
Imaging
       method  number  orbital_period  mass  distance  year
29    Imaging       1             NaN   NaN     45.52  2005
30    Imaging       1             NaN   NaN    165.00  2007
31    Imaging       1             NaN   NaN    140.00  2004
33    Imaging       1             NaN   NaN       NaN  2008
34    Imaging       1             NaN   NaN    145.00  2013
35    Imaging       1             NaN   NaN    139.00  2004
36    Imaging       1             NaN   NaN     18.39  2006
47    Imaging       1         6000.00   NaN     19.28  2008
54    Imaging       1             NaN   NaN     52.03  2012
68    Imaging       1       318280.00   NaN      7.69  2008
69    Imaging       1             NaN   NaN    145.00  2008
70    Imaging       1             NaN   NaN     36.00  2013
71    Imaging       1             NaN   NaN    140.00  2010
72    Imaging       1         4639.15   NaN     12.21  2009
73    Imaging       1             NaN   NaN     52.40  2004
74    Imaging       1         7336.50   NaN     25.00  2009
75    Imaging       1         8679.70   NaN     26.67  2009
89    Imaging       1        10037.50   NaN     23.10  2011
90    Imaging       1             NaN   NaN       NaN  2006
124   Imaging       1             NaN   NaN     17.95  2013
150   Imaging       1             NaN   NaN    145.00  2010
392   Imaging       1             NaN   NaN     91.57  2013
423   Imaging       1             NaN   NaN     91.83  2013
577   Imaging       1             NaN   NaN     40.85  2006
635   Imaging       1             NaN   NaN     11.43  2010
639   Imaging       1             NaN   NaN    131.93  2010
643   Imaging       4       170000.00   NaN     39.94  2008
644   Imaging       4        69000.00   NaN     39.94  2008
645   Imaging       4        37000.00   NaN     39.94  2008
646   Imaging       4        18000.00   NaN     39.94  2010
900   Imaging       1        40000.00   NaN       NaN  2011
937   Imaging       1       730000.00   NaN       NaN  2006
948   Imaging       1             NaN   NaN    135.00  2013
949   Imaging       1             NaN   NaN    120.00  2013
950   Imaging       1             NaN   NaN       NaN  2010
957   Imaging       1             NaN   NaN       NaN  2008
1027  Imaging       1             NaN   NaN     19.20  2011
1029  Imaging       1             NaN   NaN     10.10  2012
Microlensing
           method  number  orbital_period  mass  distance  year
902  Microlensing       1             NaN   NaN       NaN  2008
903  Microlensing       1             NaN   NaN       NaN  2008
904  Microlensing       1             NaN   NaN       NaN  2009
905  Microlensing       1             NaN   NaN    3600.0  2013
906  Microlensing       1          2780.0   NaN       NaN  2011
907  Microlensing       1             NaN   NaN       NaN  2010
908  Microlensing       1          1970.0   NaN       NaN  2010
909  Microlensing       1             NaN   NaN    2300.0  2012
910  Microlensing       1             NaN   NaN    2800.0  2012
911  Microlensing       1             NaN   NaN    7720.0  2012
912  Microlensing       1             NaN   NaN    7560.0  2013
917  Microlensing       1             NaN   NaN       NaN  2004
918  Microlensing       1          3600.0   NaN       NaN  2005
919  Microlensing       1          3300.0   NaN       NaN  2006
920  Microlensing       1          3500.0   NaN       NaN  2005
921  Microlensing       2          1825.0   NaN       NaN  2008
922  Microlensing       2          5100.0   NaN       NaN  2008
923  Microlensing       1             NaN   NaN       NaN  2009
924  Microlensing       1             NaN   NaN    2570.0  2012
925  Microlensing       2             NaN   NaN    4080.0  2012
926  Microlensing       2             NaN   NaN    4080.0  2012
927  Microlensing       1             NaN   NaN    1760.0  2013
928  Microlensing       1             NaN   NaN    4970.0  2013
Orbital Brightness Modulation
                            method  number  orbital_period  mass  distance  \
787  Orbital Brightness Modulation       2        0.240104   NaN    1180.0
788  Orbital Brightness Modulation       2        0.342887   NaN    1180.0
792  Orbital Brightness Modulation       1        1.544929   NaN       NaN

     year
787  2011
788  2011
792  2013
Pulsar Timing
            method  number  orbital_period  mass  distance  year
941  Pulsar Timing       3       25.262000   NaN       NaN  1992
942  Pulsar Timing       3       66.541900   NaN       NaN  1992
943  Pulsar Timing       3       98.211400   NaN       NaN  1994
944  Pulsar Timing       1    36525.000000   NaN       NaN  2003
945  Pulsar Timing       1        0.090706   NaN    1200.0  2011
Pulsation Timing Variations
                          method  number  orbital_period  mass  distance  year
958  Pulsation Timing Variations       1          1170.0   NaN       NaN  2007
Radial Velocity
              method  number  orbital_period   mass  distance  year
0    Radial Velocity       1        269.3000   7.10     77.40  2006
1    Radial Velocity       1        874.7740   2.21     56.95  2008
2    Radial Velocity       1        763.0000   2.60     19.84  2011
3    Radial Velocity       1        326.0300  19.40    110.62  2007
4    Radial Velocity       1        516.2200  10.50    119.47  2009
..               ...     ...             ...    ...       ...   ...
914  Radial Velocity       1          6.9580   0.34       NaN  2014
915  Radial Velocity       1          5.1180   0.40       NaN  2014
916  Radial Velocity       1        121.7100   1.54       NaN  2014
939  Radial Velocity       1          4.4264    NaN       NaN  2012
940  Radial Velocity       1          2.1451    NaN       NaN  2012

[553 rows x 6 columns]
Transit
       method  number  orbital_period  mass  distance  year
91    Transit       1        1.508956   NaN       NaN  2008
92    Transit       1        1.742994   NaN     200.0  2008
93    Transit       1        4.256800   NaN     680.0  2008
94    Transit       1        9.202050   NaN       NaN  2008
95    Transit       1        4.037896   NaN       NaN  2009
...       ...     ...             ...   ...       ...   ...
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

[397 rows x 6 columns]
Transit Timing Variations
                        method  number  orbital_period  mass  distance  year
680  Transit Timing Variations       2        160.0000   NaN    2119.0  2011
736  Transit Timing Variations       2         57.0110   NaN     855.0  2012
749  Transit Timing Variations       3             NaN   NaN       NaN  2014
813  Transit Timing Variations       2         22.3395   NaN     339.0  2013

In [18]:
#Descripciones sobre los métodos
planets.groupby('method')['year'].describe()#

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [213]:
#Aggregate: método indicar varias funciones
#planets.groupby('method').aggregate(['min',np.median,max]) #aplicarlas a todas las variables
planets.groupby('method').aggregate({'orbital_period': ['min','max',lambda x: np.sum(x),'sum'],
                                     'mass': np.mean}) #Especificar

                              orbital_period                               \
                                         min            max    <lambda_0>
method
Astrometry                        246.360000    1016.000000  1.262360e+03
Eclipse Timing Variations        1916.250000   10220.000000  4.276480e+04
Imaging                          4639.150000  730000.000000  1.418973e+06
Microlensing                     1825.000000    5100.000000  2.207500e+04
Orbital Brightness Modulation       0.240104       1.544929  2.127920e+00
Pulsar Timing                       0.090706   36525.000000  3.671511e+04
Pulsation Timing Variations      1170.000000    1170.000000  1.170000e+03
Radial Velocity                     0.736540   17337.500000  4.553151e+05
Transit                             0.355000     331.600590  8.377523e+03
Transit Timing Variations          22.339500     160.000000  2.393505e+02

                                                 mass
                                        sum      mean
method
Astrometry                     1.262360e+03       NaN
Eclipse Timing Variations      4.276480e+04  5.125000
Imaging                        1.418973e+06       NaN
Microlensing                   2.207500e+04       NaN
Orbital Brightness Modulation  2.127920e+00       NaN
Pulsar Timing                  3.671511e+04       NaN
Pulsation Timing Variations    1.170000e+03       NaN
Radial Velocity                4.553151e+05  2.630699
Transit                        8.377523e+03  1.470000
Transit Timing Variations      2.393505e+02       NaN

In [214]:
#Filter
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])

def filter_func(x):
    return x['data2'].std() > 4

print(df); print(df.groupby('key').std());
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [218]:
#Filtro avanzado sobre variables agrupadas
planets.groupby('method').filter(lambda x: x['year'].min() > 1989 )

                         method  number  orbital_period  mass  distance  year
29                      Imaging       1             NaN   NaN     45.52  2005
30                      Imaging       1             NaN   NaN    165.00  2007
31                      Imaging       1             NaN   NaN    140.00  2004
32    Eclipse Timing Variations       1    10220.000000  6.05       NaN  2009
33                      Imaging       1             NaN   NaN       NaN  2008
...                         ...     ...             ...   ...       ...   ...
1030                    Transit       1        3.941507   NaN    172.00  2006
1031                    Transit       1        2.615864   NaN    148.00  2007
1032                    Transit       1        3.191524   NaN    174.00  2007
1033                    Transit       1        4.125083   NaN    293.00  2008
1034                    Transit       1        4.187757   NaN    260.00  2008

[482 rows x 6 columns]

In [221]:
#Estandarizar: (x - media)/std
df.groupby('key').transform(lambda x: (x - x.mean())/x.std())

      data1     data2
0 -0.707107  0.707107
1 -0.707107 -0.707107
2 -0.707107 -0.707107
3  0.707107 -0.707107
4  0.707107  0.707107
5  0.707107  0.707107

In [228]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum() #Considera cada grupo distinto. 
    return x
print(df); print(df.groupby('key',group_keys=True).apply(norm_by_data2).index)
print(df.groupby('key',group_keys=False).apply(norm_by_data2)) #¿Cuál es la diferencia?

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
MultiIndex([('A', 0),
            ('A', 3),
            ('B', 1),
            ('B', 4),
            ('C', 2),
            ('C', 5)],
           names=['key', None])
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [ ]:
#Podemos agrupar de forma personalizada
df2 = df.set_index('key') #Creamos el index.
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'} #Definimos condiciones
print(df2); print(df2.groupby(mapping).sum())
#df2.groupby([str.lower, mapping]).mean()

## Pivoteo

<img src=https://www.statology.org/wp-content/uploads/2021/12/wideLong1-1.png>

In [229]:
import numpy as np
import pandas as pd
wide = pd.DataFrame([['A',88,12,22],['B',91,17,28],
                     ['C',99,24,30],['D',94,28,31]],
                     columns=['Team','Points','Assists','Rebounds'])

wide

  Team  Points  Assists  Rebounds
0    A      88       12        22
1    B      91       17        28
2    C      99       24        30
3    D      94       28        31

In [232]:
long = pd.melt(wide,#datos
               id_vars=['Team'], #Observaciones
               value_vars=['Points','Assists','Rebounds'], #Variables #opcional
               var_name='Variable',value_name='Value') #Opcional
long

   Team  Variable  Value
0     A    Points     88
1     B    Points     91
2     C    Points     99
3     D    Points     94
4     A   Assists     12
5     B   Assists     17
6     C   Assists     24
7     D   Assists     28
8     A  Rebounds     22
9     B  Rebounds     28
10    C  Rebounds     30
11    D  Rebounds     31

In [241]:
wide2 = pd.pivot_table(long,index = 'Team', #id
                       columns='Variable', #Convertir en columnas, tiene el nombre de la columna
                       values = 'Value') #Valores
wide2
#wide.compare(wide2)

wide2.reset_index(inplace=True)
#wide2
#wide.compare(wide2)
#Ordenar las columnas
#Quitar los axis name
#wide.sort_index().sort_index(axis=1) == wide2.sort_index().sort_index(axis=1).rename_axis(columns='')

print(wide.sort_index().sort_index(axis=1).compare(wide2.sort_index().sort_index(axis=1).rename_axis(columns='')))

Empty DataFrame
Columns: []
Index: []

In [27]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [28]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

In [ ]:
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

In [ ]:

DataFrame.pivot_table(data, #Método y función.
                      values=None, 
                      index=None, 
                      columns=None,
                      aggfunc='mean', #Diccionario por columna. 
                      fill_value=None, #Reemplazar NA
                      margins=False, #Total
                      dropna=True, #Eliminar NA
                      margins_name='All') #Nombre de la columna de total

In [29]:
titanic.pivot_table(index='sex', columns='class',
                    aggfunc={'survived':sum, 'fare':'mean'})
titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

## Operaciones vectorizadas con strings

In [31]:
#Métodos comunes
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])
monte.str.len()
monte.str.lower()
monte.str.capitalize()
monte.str.startswith('T')
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

In [38]:
#Expresiones regulares
monte.str.extract('([A-Za-z]+)')
monte.str.extract('([A-Za-z]+) ([A-Z])')
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0    [Graham Chapman]
1                  []
2     [Terry Gilliam]
3                  []
4       [Terry Jones]
5     [Michael Palin]
dtype: object

In [ ]:
#Slicing, joining,...
monte.str[0:3]
monte.str.split().str.get(-1)

In [ ]:
full_monte = pd.DataFrame({'name': monte,
                           'info': ['B|C|D', 'B|D', 'A|C', 'B|D', 'B|C','B|C|D']})
full_monte['info'].str.get_dummies('|')

## Eval y query

In [39]:
import pandas as pd
nrows, ncols = 100000, 100
rng = np.random.RandomState(42)
df1, df2, df3, df4 = (pd.DataFrame(rng.rand(nrows, ncols)) for i in range(4))
%timeit df1 + df2 + df3 + df4
%timeit pd.eval('df1 + df2 + df3 + df4') #Comparaciones también
#eval('df1 < df2 <= df3 != df4')
#eval('(df1 < 0.5) & (df2 < 0.5) | (df3 < df4)') También con or y and
#eval('df2.T[0] + df3.iloc[1]')

198 ms ± 18.9 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
104 ms ± 9.23 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [43]:
result1 = (df['A'] + df['B']) / (df['C'] - 1)
result2 = pd.eval("(df.A + df.B) / (df.C - 1)")
result3 = df.eval('(A + B) / (C - 1)')
np.allclose(result1, result2) #Son cercanos a precisión de máquina
np.allclose(result1, result3)

True

In [46]:
df.eval('D = (A + B) / (C - 1)',inplace = True)
df.tail()

            A         B         C         D
995  0.248944  0.873735  0.666527 -3.366625
996  0.586569  0.881918  0.674439 -4.510638
997  0.787831  0.906578  0.053096 -1.789421
998  0.157618  0.393238  0.154573 -0.651571
999  0.527387  0.983957  0.824394 -8.606423

In [ ]:
column_mean = df.mean(1)
result1 = df['A'] + column_mean
result2 = df.eval('A + @column_mean') #@ indica que es una variable, no una columna.
np.allclose(result1, result2)

In [ ]:
result1 = df[(df.A < 0.5) & (df.B < 0.5)]
result2 = df.query('A < 0.5 and B < 0.5')
np.allclose(result1, result2)

In [ ]:
Cmean = df['C'].mean()
result1 = df[(df.A < Cmean) & (df.B < Cmean)]
result2 = df.query('A < @Cmean and B < @Cmean')
np.allclose(result1, result2)

- Todas las expresiones compuestas de numpy o pandas involucra la creación de arrays temporales.
- Si el tamaño de los archivos temporables es significativamente grande en comparación con la RAM, se puede usar query y eval.

## Otros métodos

- drop_duplicates
- reindex(index = [])
- rename(columns = {}) #Renombrar columnas o filas
- rename(str.lower, axis='columns') #Aplicar funciones 
- pop #Eliminar columnas
- del df[columna]
- sort(columns = [],ascending = [0,1])
- subset.apply(mean, axis=1)
- applymap / map #Elemento por elemento
- planets.dtypes
- compare
- combine_first